# DeltaDegreeF Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..DeltaDegreeF Property
SymbolTypeId Class See Also
---
Symbol delta°F, indicating unit Fahrenheit interval.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId DeltaDegreeF { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DeltaDegreeF As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DeltaDegreeF {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace